[
    {
      "text": "At this point in the siege, Lee's army had strengthened the Petersburg line. They dug breastworks out of rifle pits. At night, with pick and shovel, they then turned the breastworks into  deep trenches. Pointed stakes turned outwards were designed to break up any frontal attacks. The area between the two lines became a no man's land. The summer that year was hot and dry. Streams and springs were quickly drying up causing a water shortage on both sides. The siege was quickly becoming a stalemate.",
      "title": "Siege of Petersburg",
      "url": "https://simple.wikipedia.org/wiki/Siege%20of%20Petersburg",
      "wiki_id": "20231101.simple_550339_9"
    },
    {
      "text": "1944  Holocaust: Anne Frank and her family are placed on the last transport train from the Westerbork transit camp to Auschwitz.",
      "title": "September 3",
      "url": "https://simple.wikipedia.org/wiki/September%203",
      "wiki_id": "20231101.simple_8532_17"
    },
    {
      "text": "A brownout is a drop of voltage in an electrical power supply. Brownouts may be done intentionally in order to reduce the load during an emergency. This is done to prevent a total supply failure (\"blackout\"). Brownouts can also be caused accidentally by faults in the electrical grid which cause a drop in voltage.",
      "title": "Brownout (electricity)",
      "url": "https://simple.wikipedia.org/wiki/Brownout%20%28electricity%29",
      "wiki_id": "20231101.simple_427821_0"
    },
    {
      "text": "Mercedes Pomares is a volleyball player from Cuba. Mercedes competed at the 1972 Summer Olympics, the 1976 Summer Olympics and the 1980 Summer Olympics. She was born on 9 April 1954.",
      "title": "Mercedes Pomares",
      "url": "https://simple.wikipedia.org/wiki/Mercedes%20Pomares",
      "wiki_id": "20231101.simple_1030317_0"
    },
    {
      "text": "Occidental (Western) region or Chaco, to the north of the Paraguay river (departments: Alto Paraguay, Boquerón and Presidente Hayes)",
      "title": "Paraguay",
      "url": "https://simple.wikipedia.org/wiki/Paraguay",
      "wiki_id": "20231101.simple_11418_6"
    },
    {
      "text": "Similarly to other hearing problems, hyperacusis can occur suddenly or gradually over time and is a problem that can affect people of all different ages in one or both ears. Again, like other forms of hearing problems, there are a variety of possible causes ranging from exposure to noise and other diseases.",
      "title": "Hyperacusis",
      "url": "https://simple.wikipedia.org/wiki/Hyperacusis",
      "wiki_id": "20231101.simple_555123_4"
    },
    {
      "text": "Volleyball has been played at the Summer Olympics ever since the 1964 Summer Olympics. The history of Olympic volleyball can be traced back to the 1924 Summer Olympics in Paris, where volleyball was played as part of an American sports demonstration event. It was only added as an Olympic sport, however, after World War II. This was when the FIVB was founded and of some of the continental confederations. In 1957, a special tournament was held at the 53rd IOC session in Sofia, Bulgaria, to support such request. The competition was a success, and the sport was officially introduced in 1964. The Olympic Committee initially dropped volleyball for the 1968 Olympics, meeting protests.",
      "title": "Volleyball at the Summer Olympics",
      "url": "https://simple.wikipedia.org/wiki/Volleyball%20at%20the%20Summer%20Olympics",
      "wiki_id": "20231101.simple_526311_0"
    },
    {
      "text": "Blood Siblings (Blood Brothers/Blood Sisters): Not to be confused with a consanguineous sibling, a blood brother or blood sister is a person to whom one has sworn loyalty through a ritual blood oath. The custom is rare in Western culture.",
      "title": "Sibling",
      "url": "https://simple.wikipedia.org/wiki/Sibling",
      "wiki_id": "20231101.simple_49510_12"
    },
    {
      "text": "Joncherey is a commune. It is found in the region Bourgogne-Franche-Comté in the Territoire de Belfort department in  the northeast of France.",
      "title": "Joncherey",
      "url": "https://simple.wikipedia.org/wiki/Joncherey",
      "wiki_id": "20231101.simple_831865_0"
    },
    {
      "text": "Vinicius is the mascot of the 2016 Summer Olympics, and Tom is the mascot of the 2016 Summer Paralympics. The mascots represent Rio de Janeiro, Brazil. Vinicius represents Brazilian animals, and his body has parts of cats, monkeys, and birds. Tom represents Brazilian plant life.",
      "title": "Vinicius and Tom",
      "url": "https://simple.wikipedia.org/wiki/Vinicius%20and%20Tom",
      "wiki_id": "20231101.simple_655204_0"
    }
]