[
    {
      "text": "At this point in the siege, Lee's army had strengthened the Petersburg line. They dug breastworks out of rifle pits. At night, with pick and shovel, they then turned the breastworks into  deep trenches. Pointed stakes turned outwards were designed to break up any frontal attacks. The area between the two lines became a no man's land. The summer that year was hot and dry. Streams and springs were quickly drying up causing a water shortage on both sides. The siege was quickly becoming a stalemate.",
      "title": "Siege of Petersburg",
      "url": "https://simple.wikipedia.org/wiki/Siege%20of%20Petersburg",
      "wiki_id": "20231101.simple_550339_9"
    },
    {
      "text": "1944  Holocaust: Anne Frank and her family are placed on the last transport train from the Westerbork transit camp to Auschwitz.",
      "title": "September 3",
      "url": "https://simple.wikipedia.org/wiki/September%203",
      "wiki_id": "20231101.simple_8532_17"
    },
    {
      "text": "A brownout is a drop of voltage in an electrical power supply. Brownouts may be done intentionally in order to reduce the load during an emergency. This is done to prevent a total supply failure (\"blackout\"). Brownouts can also be caused accidentally by faults in the electrical grid which cause a drop in voltage.",
      "title": "Brownout (electricity)",
      "url": "https://simple.wikipedia.org/wiki/Brownout%20%28electricity%29",
      "wiki_id": "20231101.simple_427821_0"
    },
    {
      "text": "Lagrasse is a commune of 545 people (2017). It is in the region Occitanie in the Aude department in the south of France.",
      "title": "Lagrasse",
      "url": "https://simple.wikipedia.org/wiki/Lagrasse",
      "wiki_id": "20231101.simple_758011_0"
    },
    {
      "text": "Occidental (Western) region or Chaco, to the north of the Paraguay river (departments: Alto Paraguay, Boquerón and Presidente Hayes)",
      "title": "Paraguay",
      "url": "https://simple.wikipedia.org/wiki/Paraguay",
      "wiki_id": "20231101.simple_11418_6"
    },
    {
      "text": "Similarly to other hearing problems, hyperacusis can occur suddenly or gradually over time and is a problem that can affect people of all different ages in one or both ears. Again, like other forms of hearing problems, there are a variety of possible causes ranging from exposure to noise and other diseases.",
      "title": "Hyperacusis",
      "url": "https://simple.wikipedia.org/wiki/Hyperacusis",
      "wiki_id": "20231101.simple_555123_4"
    },
    {
      "text": "In 1886, Adolf Mayer first described the tobacco mosaic disease that could be transferred between plants, similar to bacterial infections.",
      "title": "Tobacco mosaic virus",
      "url": "https://simple.wikipedia.org/wiki/Tobacco%20mosaic%20virus",
      "wiki_id": "20231101.simple_528724_2"
    },
    {
      "text": "Blood Siblings (Blood Brothers/Blood Sisters): Not to be confused with a consanguineous sibling, a blood brother or blood sister is a person to whom one has sworn loyalty through a ritual blood oath. The custom is rare in Western culture.",
      "title": "Sibling",
      "url": "https://simple.wikipedia.org/wiki/Sibling",
      "wiki_id": "20231101.simple_49510_12"
    },
    {
      "text": "Joncherey is a commune. It is found in the region Bourgogne-Franche-Comté in the Territoire de Belfort department in  the northeast of France.",
      "title": "Joncherey",
      "url": "https://simple.wikipedia.org/wiki/Joncherey",
      "wiki_id": "20231101.simple_831865_0"
    },
    {
      "text": "Pornhub.COM is a pornographic video sharing website and the largest pornography site on the Internet. Pornhub was launched in Montreal in 2007. Pornhub also has offices and servers in San Francisco, Houston, New Orleans and London.",
      "title": "Pornhub",
      "url": "https://simple.wikipedia.org/wiki/Pornhub",
      "wiki_id": "20231101.simple_633642_0"
    }
]